---
type: RelinquishedItems
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# RelinquishedItems

`Autodesk.Revit.DB.RelinquishedItems` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetRelinquishedElements | 2014 | `public ICollection < ElementId > GetRelinquishedElements ()` |
| Method | GetRelinquishedWorksets | 2014 | `public ICollection < WorksetId > GetRelinquishedWorksets ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |